app/Controllers/Tasks.php

    public function index()
    {
        $task = new TaskModel();
        return $this->respond($task->findAll());
---
SELECT *
FROM `tasks`

    public function show($id = null)
    {
        $task = new TaskModel();
        $data = $task->find($id);
---
SELECT *
FROM `tasks`
WHERE `tasks`.`task_id` = '1'

    public function create()
    {
        $rules = [
            "name" => "required",
            "description" => "required",
            "user" => "required",
        ];


        if(!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        } else {

            $data = [
                "name" => $this->request->getVar("name"),
                "description" => $this->request->getVar("description"),
                "user" => $this->request->getVar("user")
            ];

            // Submission
            $task = new TaskModel();
            $task->save($data);
---
INSERT INTO `tasks` (`name`, `description`, `user`) VALUES ('Graphic Design Time', 'Making Creative Application', 'Alain')

    public function edit($id = null)
    {
        $rules = [
            "name" => "required",
            "description" => "required",
            "user" => "required",
        ];


        if(!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        } else {

            $task = new TaskModel();
            $data = $task->find($id);
            if(empty($data)) {
                return $this->failNotFound("Task to update is not found!");
            } else {
                $data = [
                    "name" => $this->request->getVar("name"),
                    "description" => $this->request->getVar("description"),
                    "user" => $this->request->getVar("user")
                ];

                // Submission
                $task = new TaskModel();
                $task->update($id, $data);
---
SELECT *
FROM `tasks`
WHERE `tasks`.`task_id` = '3'
UPDATE `tasks` SET `name` = 'Playing Game', `description` = 'Game to play is the fallen throne', `user` = 'Kubbs'
WHERE `tasks`.`task_id` IN ('3')

    public function delete($id = null)
    {
        $task = new TaskModel();
        $data = $task->find($id);
        if(empty($data)) {
            return $this->failNotFound("Task to delete is not found!");
        } else {
            $task->delete($id);
---
SELECT *
FROM `tasks`
WHERE `tasks`.`task_id` = '5'
DELETE FROM `tasks`
WHERE `task_id` IN ('5')